VPro/src/Catalogs/LegalDocuments/LegalDocuments.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>LegalDocuments</name>
  <owners>Catalog.Counterparties</owners>
  <owners>Catalog.Companies</owners>
  <owners>Catalog.Individuals</owners>
  <attributes>
    <name>DocumentKind</name>
    <type>
      <types>CatalogRef.DocumentKinds</types>
    </type>
  </attributes>
  <attributes>
    <name>Number</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IssueDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ExpiryDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Authority</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

VPro/src/Catalogs/LegalDocuments/Forms/ItemForm/Module.bsl
#Region FormEventHadlers

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	SmallBusinessClientServer.SetPictureForComment(Items.GroupComment, Object.Comment);
	
	// StandardSubsystems.ObjectsAttributesEditProhibition
	ObjectsAttributesEditProhibition.LockAttributes(ThisForm);
	// End StandardSubsystems.ObjectsAttributesEditProhibition
	
EndProcedure

&AtServer
Procedure AfterWriteAtServer(CurrentObject, WriteParameters)
	
	SmallBusinessClientServer.SetPictureForComment(Items.GroupComment, Object.Comment);
	
	// Handler of the subsystem prohibiting the object attribute editing.
	ObjectsAttributesEditProhibition.LockAttributes(ThisForm);
	
EndProcedure

#EndRegion

#Region FormItemEventHadlers

&AtClient
Procedure DocumentKindOnChange(Item)
	
	Object.Description = GenerateDescription(Object.DocumentKind, Object.Number, Object.IssueDate);
	
EndProcedure

&AtClient
Procedure NumberOnChange(Item)
	
	Object.Description = GenerateDescription(Object.DocumentKind, Object.Number, Object.IssueDate);
	
EndProcedure

&AtClient
Procedure IssueDateOnChange(Item)
	
	Object.Description = GenerateDescription(Object.DocumentKind, Object.Number, Object.IssueDate);
	
EndProcedure

#EndRegion

#Region ServiceProceduresAndFunctions

&AtClientAtServerNoContext
Function GenerateDescription(DocumentKind, Number, IssueDate)
	
	TextName = NStr("en='%DocumentKind% # %Number% %IssueDate%';ru='%DocumentKind% № %Number% %IssueDate%';vi='%DocumentKind% số %Number% %IssueDate%'");
	TextName = StrReplace(TextName, "%DocumentKind%", TrimAll(String(DocumentKind)));
	TextName = StrReplace(TextName, "%Number%", TrimAll(Number));
	TextName = StrReplace(TextName, "%IssueDate%", ?(ValueIsFilled(IssueDate), NStr("en='from ';ru='от ';vi='từ'") + TrimAll(String(Format(IssueDate, "DF=dd.MM.yyyy"))), ""));
	
	Return TextName;
	
EndFunction

#EndRegion
